#+PROPERTY: session *R:3*
#+PROPERTY: results silent
#+PROPERTY: exports both

* Download hourly data

The NLDAS archive begins at [1979-01-01 13:00].  Our experience is
that the most recent data available is four days before the present.
When starting with no data one should use the following date sequence
to specify the complete collection:

#+NAME: nldasDates
#+HEADER: :var fromYear=  1979
#+HEADER: :var fromMonth=    1 
#+HEADER: :var fromDay=      1 
#+HEADER: :var fromHour=    13
#+BEGIN_SRC R :results output silent
  nldasDates <-
    seq(
      from= ISOdate(
        year=  fromYear,
        month= fromMonth,
        day=   fromDay,
        hour=  fromHour),
      to= as.POSIXlt( Sys.Date() - 4),
      by= "hour")
#+END_SRC

Using the default arguments will populate the data as follows:


#+CALL: nldasDates()

#+RESULTS:

#+BEGIN_SRC R :results value
  head( nldasDates)
#+END_SRC

#+RESULTS:
| 1979-01-01 13:00:00 |
| 1979-01-01 14:00:00 |
| 1979-01-01 15:00:00 |
| 1979-01-01 16:00:00 |
| 1979-01-01 17:00:00 |
| 1979-01-01 18:00:00 |

#+BEGIN_SRC R :results replace
  tail( nldasDates)
#+END_SRC

#+RESULTS:
| 2013-08-31 19:00:00 |
| 2013-08-31 20:00:00 |
| 2013-08-31 21:00:00 |
| 2013-08-31 22:00:00 |
| 2013-08-31 23:00:00 |
| 2013-09-01 00:00:00 |

When updating an existing collection one should specify the download
date sequence as follows:

#+CALL: nldasDates( fromYear= 2013, fromMonth= 9, fromDay= 21, fromHour= 1)

#+RESULTS:

src_R[:results replace value]{head(nldasDates)}
| 2013-09-21 01:00:00 |
| 2013-09-21 02:00:00 |
| 2013-09-21 03:00:00 |
| 2013-09-21 04:00:00 |
| 2013-09-21 05:00:00 |
| 2013-09-21 06:00:00 |

#+NAME: nldasDataUrls
#+BEGIN_SRC R :file data/nldasDataUrls :results replace
nldasDataUrls <-
  paste(
    baseUrl,
    format( nldasDates, "%Y/%j/NLDAS_FORA0125_H.A%Y%m%d.%H00.002.grb*"),
    ## format( nldasDates, "%Y/%j"),
    ## "*.grb*",
    sep= "/")
#+END_SRC

#+RESULTS: nldasDataUrls
[[file:data/nldasDataUrls]]


* Work out checksum verification using first URL

#+NAME: firstNldasDataUrl
#+BEGIN_SRC R
  head( nldasDataUrls, 1)
#+END_SRC

#+NAME: nldasWget
#+HEADER: :var url= firstNldasDataUrl()
#+BEGIN_SRC sh :session :results value replace
  wget \
      --no-host-directories \
      --cut-dirs=3 \
      --directory-prefix=data \
      --recursive \
      --quiet \
      --retry-connrefused \
      --timestamping \
      ${url}
#+END_SRC

Remember =--progress=dot:mega= in place of =--no-verbose=.


#+NAME: nldasWgetResult
#+HEADER: :var url= firstNldasDataUrl()
#+BEGIN_SRC sh :session :results value replace
    find data/$(echo -n ${url} | cut -d/ -f7-9) \
        -name $(echo -n ${url} | cut -d/ -f10) 
#+END_SRC

#+RESULTS: nldasWgetResult
| data/NLDAS_FORA0125_H.002/2013/186/NLDAS_FORA0125_H.A20130705.0000.002.grb     |
| data/NLDAS_FORA0125_H.002/2013/186/NLDAS_FORA0125_H.A20130705.0000.002.grb.xml |



* Convert GRB metadata to CDO parameter table

#+BEGIN_SRC sh :session :results output verbatim replace
  ~/src/wgrib/wgrib -v data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb \
      | perl -lpe 's/ \[/:/; s/[\]\"]//g' \
      | cut -d: -f4,5,6,9,10
#+END_SRC

#+RESULTS:
#+begin_example
TMP:2 m above gnd:kpds=11,105,2:Temp.:K
SPFH:2 m above gnd:kpds=51,105,2:Specific humidity:kg/kg
PRES:sfc:kpds=1,1,0:Pressure:Pa
UGRD:10 m above gnd:kpds=33,105,10:u wind:m/s
VGRD:10 m above gnd:kpds=34,105,10:v wind:m/s
DLWRF:sfc:kpds=205,1,0:Downward longwave radiation flux:W/m^2
var153:sfc:kpds=153,1,0:undefined
CAPE:180-0 mb above gnd:kpds=157,116,46080:Convective available potential energy:J/Kg
PEVAP:sfc:kpds=228,1,0:Potential evaporation:Kg/m^2
APCP:sfc:kpds=61,1,0:Total precipitation:kg/m^2
DSWRF:sfc:kpds=204,1,0:Downward shortwave radiation flux:W/m^2
#+end_example

#+BEGIN_SRC sh :exports both :session :results output raw replace
  echo '|-' 
  echo '|variable|height|codes|description|units|'
  echo '|-' 
  ~/src/wgrib/wgrib -v data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb \
      | perl -lpe 's/ \[/:/; s/[\]\"]//g' \
      | cut -d: -f4,5,6,9,10 \
      | perl -lne 's/:/\|/g; print "|$_|"'
  echo '|-'
#+END_SRC

#+RESULTS:
|----------+--------------------+--------------------+---------------------------------------+--------|
| variable | height             | codes              | description                           | units  |
|----------+--------------------+--------------------+---------------------------------------+--------|
| TMP      | 2 m above gnd      | kpds=11,105,2      | Temp.                                 | K      |
| SPFH     | 2 m above gnd      | kpds=51,105,2      | Specific humidity                     | kg/kg  |
| PRES     | sfc                | kpds=1,1,0         | Pressure                              | Pa     |
| UGRD     | 10 m above gnd     | kpds=33,105,10     | u wind                                | m/s    |
| VGRD     | 10 m above gnd     | kpds=34,105,10     | v wind                                | m/s    |
| DLWRF    | sfc                | kpds=205,1,0       | Downward longwave radiation flux      | W/m^2  |
| var153   | sfc                | kpds=153,1,0       | undefined                             |        |
| CAPE     | 180-0 mb above gnd | kpds=157,116,46080 | Convective available potential energy | J/Kg   |
| PEVAP    | sfc                | kpds=228,1,0       | Potential evaporation                 | Kg/m^2 |
| APCP     | sfc                | kpds=61,1,0        | Total precipitation                   | kg/m^2 |
| DSWRF    | sfc                | kpds=204,1,0       | Downward shortwave radiation flux     | W/m^2  |
|----------+--------------------+--------------------+---------------------------------------+--------|

These correspond to the values we must give to CDO in a 'parameter table'.

#+BEGIN_SRC sh :session :results output verbatim replace
  cat data/cdoPartab
#+END_SRC

#+RESULTS:
#+begin_example
11	TMP	air temperature at 2m [K]
51	SPFH	specific humidity [kg/kg]
1	PRES	pressure [Pa]
33	UGRD	u wind [m/s]
34	VGRD	v wind [m/s]
205	DLWRF	downward longwave radiation flux [W/m^2]
153	var153	undefined
157	CAPE	convective available potential energy [J/kg]
228	PEVAP	potential evaporation [kg/m^2]
61	APCP	accumulated precipitation [mm]
204	DSWRF	downward shortwave radiation [W/m^2]
#+end_example


* Create a mask from the first day's data
  :PROPERTIES:
  :session:  *R*
  :END:

#+BEGIN_SRC sh :session :results silent
  mkdir data/output
#+END_SRC

#+BEGIN_SRC sh :session :results output replace
  gdalwarp -overwrite \
      -t_srs EPSG:4326 \
      -te -180 -90 180 90 \
      -tr 0.08333333 0.08333333 \
      -srcnodata 9999 \
      -dstnodata 9999 \
      data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb \
      data/output/nldasMask5minRaw.tif
#+END_SRC

#+RESULTS:
: 
: > > > > > > Creating output file that is 4320P x 2160L.
: Processing input file data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb.
: 0...10...20...30...40...50...60...70...80...90...100 - done.

#+BEGIN_SRC sh :session :results output
  gdalinfo data/output/nldasMask5minRaw.tif
#+END_SRC

#+RESULTS:
#+begin_example
Driver: GTiff/GeoTIFF
Files: data/output/nldasMask5minRaw.tif
Size is 4320, 2160
Coordinate System is:
GEOGCS["WGS 84",
    DATUM["WGS_1984",
        SPHEROID["WGS 84",6378137,298.257223563,
            AUTHORITY["EPSG","7030"]],
        AUTHORITY["EPSG","6326"]],
    PRIMEM["Greenwich",0],
    UNIT["degree",0.0174532925199433],
    AUTHORITY["EPSG","4326"]]
Origin = (-180.000000000000000,90.000000000000000)
Pixel Size = (0.083333330000000,-0.083333330000000)
Metadata:
  AREA_OR_POINT=Area
Image Structure Metadata:
  INTERLEAVE=PIXEL
Corner Coordinates:
Upper Left  (-180.0000000,  90.0000000) (180d 0' 0.00"W, 90d 0' 0.00"N)
Lower Left  (-180.0000000, -89.9999928) (180d 0' 0.00"W, 89d59'59.97"S)
Upper Right ( 179.9999856,  90.0000000) (179d59'59.95"E, 90d 0' 0.00"N)
Lower Right ( 179.9999856, -89.9999928) (179d59'59.95"E, 89d59'59.97"S)
Center      (  -0.0000072,   0.0000036) (  0d 0' 0.03"W,  0d 0' 0.01"N)
Band 1 Block=4320x1 Type=Float64, ColorInterp=Gray
  NoData Value=9999
Band 2 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 3 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 4 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 5 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 6 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 7 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 8 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 9 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 10 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 11 Block=4320x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
#+end_example


#+BEGIN_SRC sh :session *nldas* :results output
  gdal_translate -ot Byte -b 1 \
      -a_nodata 255 \
      -scale \
      data/output/nldasMask5minRaw.tif \
      data/output/nldasMask5minByte.tif
#+END_SRC

#+RESULTS:
: 
: > > > Input file size is 4320, 2160
: 0...10...20...30...40...50...60...70...80...90...100 - done.

#+BEGIN_SRC sh :session :results output
  gdalinfo data/output/nldasMask5minByte.tif
#+END_SRC

#+RESULTS:
#+begin_example
Driver: GTiff/GeoTIFF
Files: data/output/nldasMask5minByte.tif
Size is 4320, 2160
Coordinate System is:
GEOGCS["WGS 84",
    DATUM["WGS_1984",
        SPHEROID["WGS 84",6378137,298.257223563,
            AUTHORITY["EPSG","7030"]],
        AUTHORITY["EPSG","6326"]],
    PRIMEM["Greenwich",0],
    UNIT["degree",0.0174532925199433],
    AUTHORITY["EPSG","4326"]]
Origin = (-180.000000000000000,90.000000000000000)
Pixel Size = (0.083333330000000,-0.083333330000000)
Metadata:
  AREA_OR_POINT=Area
Image Structure Metadata:
  INTERLEAVE=BAND
Corner Coordinates:
Upper Left  (-180.0000000,  90.0000000) (180d 0' 0.00"W, 90d 0' 0.00"N)
Lower Left  (-180.0000000, -89.9999928) (180d 0' 0.00"W, 89d59'59.97"S)
Upper Right ( 179.9999856,  90.0000000) (179d59'59.95"E, 90d 0' 0.00"N)
Lower Right ( 179.9999856, -89.9999928) (179d59'59.95"E, 89d59'59.97"S)
Center      (  -0.0000072,   0.0000036) (  0d 0' 0.03"W,  0d 0' 0.01"N)
Band 1 Block=4320x1 Type=Byte, ColorInterp=Gray
  NoData Value=255
#+end_example


** Scaling with gdal_translate doesn't work

#+BEGIN_SRC sh :session :results output
  gdal_translate \
      -scale 0 254 1 1 \
      data/output/nldasMask5minByte.tif \
      data/output/nldasMask5min.tif
#+END_SRC

#+RESULTS:
: Input file size is 4320, 2160
: 0...10...20...30...40...50...60...70...80...90...100 - done.


** Use R!

#+BEGIN_SRC R
  nldasMask5minByte <- setMinMax(
    raster( "data/output/nldasMask5minByte.tif"))
  
  nldasMask5min <-
    raster( nldasMask5minByte)
  NAvalue( nldasMask5min) <- 255
  
  nldasMask5min[] <-
    ifelse( !is.na( nldasMask5minByte[]), 1, NA)
  
  nldasMask5min <- writeRaster(
    nldasMask5min,
    filename= "data/output/nldasMask5min.tif",
    overwrite= TRUE,
    datatype= "LOG1S")
#+END_SRC

#+BEGIN_SRC sh :session :results output
  gdalinfo data/output/nldasMask5min.tif
#+END_SRC

#+RESULTS:
#+begin_example
Driver: GTiff/GeoTIFF
Files: data/output/nldasMask5min.tif
Size is 4320, 2160
Coordinate System is:
GEOGCS["WGS 84",
    DATUM["WGS_1984",
        SPHEROID["WGS 84",6378137,298.257223563,
            AUTHORITY["EPSG","7030"]],
        AUTHORITY["EPSG","6326"]],
    PRIMEM["Greenwich",0],
    UNIT["degree",0.0174532925199433],
    AUTHORITY["EPSG","4326"]]
Origin = (-180.000000000000000,90.000000000000000)
Pixel Size = (0.083333330000000,-0.083333330000000)
Metadata:
  AREA_OR_POINT=Area
Image Structure Metadata:
  COMPRESSION=LZW
  INTERLEAVE=BAND
Corner Coordinates:
Upper Left  (-180.0000000,  90.0000000) (180d 0' 0.00"W, 90d 0' 0.00"N)
Lower Left  (-180.0000000, -89.9999928) (180d 0' 0.00"W, 89d59'59.97"S)
Upper Right ( 179.9999856,  90.0000000) (179d59'59.95"E, 90d 0' 0.00"N)
Lower Right ( 179.9999856, -89.9999928) (179d59'59.95"E, 89d59'59.97"S)
Center      (  -0.0000072,   0.0000036) (  0d 0' 0.03"W,  0d 0' 0.01"N)
Band 1 Block=4320x1 Type=Byte, ColorInterp=Gray
  Min=1.000 Max=1.000 
  Minimum=1.000, Maximum=1.000, Mean=1.000, StdDev=0.000
  NoData Value=255
  Metadata:
    STATISTICS_MAXIMUM=1
    STATISTICS_MEAN=1
    STATISTICS_MINIMUM=1
    STATISTICS_STDDEV=0
#+end_example


* Write out grid cells

#+BEGIN_SRC R :results silent
  nldasCells5min <- which( as.logical( nldasMask5min[]))
  
  cat(
    nldasCells5min,
    file= "data/output/nldasCells5min.txt",
    sep= "\n")
#+END_SRC


#+BEGIN_SRC sh :session :results output
  head data/output/nldasCells5min.txt
#+END_SRC

#+RESULTS:
#+begin_example
1918741
1918742
1918743
1918744
1918745
1918746
1918747
1918748
1918749
1918750
#+end_example


* Get the bounding box and write CDO grid description

#+BEGIN_SRC R
  nldasRegion <- trim( nldasMask5min, filename= "data/output/nldasRegion.tif")
#+END_SRC

#+BEGIN_SRC sh :session *nldas* :results output
  gdalwarp -overwrite \
      -t_srs EPSG:4326 \
      -tr 0.08333333 0.08333333 \
      -srcnodata 9999 \
      -dstnodata 9999 \
      data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb \
      data/output/nldasRegionRaw.tif
#+END_SRC

#+RESULTS:
: 
: > > > > > Creating output file that is 696P x 336L.
: Processing input file data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb.
: 0...10...20...30...40...50...60...70...80...90...100 - done.


#+BEGIN_SRC sh :session :results output
  gdalinfo data/output/nldasRegionRaw.tif
#+END_SRC

#+RESULTS:
#+begin_example
Driver: GTiff/GeoTIFF
Files: data/output/nldasRegionRaw.tif
Size is 696, 336
Coordinate System is:
GEOGCS["WGS 84",
    DATUM["WGS_1984",
        SPHEROID["WGS 84",6378137,298.257223563,
            AUTHORITY["EPSG","7030"]],
        AUTHORITY["EPSG","6326"]],
    PRIMEM["Greenwich",0],
    UNIT["degree",0.0174532925199433],
    AUTHORITY["EPSG","4326"]]
Origin = (-125.000500000000002,53.000500000000002)
Pixel Size = (0.083333330000000,-0.083333330000000)
Metadata:
  AREA_OR_POINT=Area
Image Structure Metadata:
  INTERLEAVE=PIXEL
Corner Coordinates:
Upper Left  (-125.0005000,  53.0005000) (125d 0' 1.80"W, 53d 0' 1.80"N)
Lower Left  (-125.0005000,  25.0005011) (125d 0' 1.80"W, 25d 0' 1.80"N)
Upper Right ( -67.0005023,  53.0005000) ( 67d 0' 1.81"W, 53d 0' 1.80"N)
Lower Right ( -67.0005023,  25.0005011) ( 67d 0' 1.81"W, 25d 0' 1.80"N)
Center      ( -96.0005012,  39.0005006) ( 96d 0' 1.80"W, 39d 0' 1.80"N)
Band 1 Block=696x1 Type=Float64, ColorInterp=Gray
  NoData Value=9999
Band 2 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 3 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 4 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 5 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 6 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 7 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 8 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 9 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 10 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
Band 11 Block=696x1 Type=Float64, ColorInterp=Undefined
  NoData Value=9999
#+end_example


#+BEGIN_SRC sh :session *nldas* :results output
  gdal_translate -ot Byte -b 1 \
      -a_nodata 255 \
      -scale \
      data/output/nldasRegionRaw.tif \
      data/output/nldasRegionByte.tif
#+END_SRC

#+RESULTS:
: 
: > > > Input file size is 696, 336
: 0...10...20...30...40...50...60...70...80...90...100 - done.


#+BEGIN_SRC R :results silent
  
  griddesFormat <- 
    "gridtype = lonlat
  xsize    = %d
  ysize    = %d
  xfirst   = %13.8f
  xinc     = %13.8f
  yfirst   = %13.8f
  yinc     = %13.8f\n"
  
  griddes <- 
    sprintf(
      griddesFormat,
      ncol( nldasRegion),
      nrow( nldasRegion),
      xmin( nldasRegion),
      res( nldasRegion)[1],
      ymin( nldasRegion),
      res( nldasRegion)[2])
  
  cat( griddes, file= "scripts/nldas_5min.grid")
#+END_SRC

#+BEGIN_SRC R :results output
  cat( griddes)
#+END_SRC

#+RESULTS:
: 
: gridtype = lonlat
: xsize    = 696
: ysize    = 336
: xfirst   = -125.00000220
: xinc     =    0.08333333
: yfirst   =   25.00000260
: yinc     =    0.08333333


** Defer remap and conversion from GRB				   :noexport:

The remap operator and its parameters are missing.

#+BEGIN_SRC R :tangle/writeMakeflow.R :results output replace :tangle no :eval no
  l_ply(
    .data= head( nldasHours),
    .fun= dumpWhiskerOutput,
    template= template,
    dataDir= "/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002")
#+END_SRC

#+RESULTS:
#+begin_example
 
/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.nc: /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb 
cdo -f nc  /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.grb /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1300.002.nc

/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1400.002.nc: /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1400.002.grb 
cdo -f nc  /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1400.002.grb /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1400.002.nc

/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1500.002.nc: /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1500.002.grb 
cdo -f nc  /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1500.002.grb /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1500.002.nc

/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1600.002.nc: /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1600.002.grb 
cdo -f nc  /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1600.002.grb /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1600.002.nc

/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1700.002.nc: /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1700.002.grb 
cdo -f nc  /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1700.002.grb /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1700.002.nc

/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1800.002.nc: /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1800.002.grb 
cdo -f nc  /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1800.002.grb /project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.1800.002.nc
#+end_example


#+BEGIN_SRC R :eval no
  file.remove( "Makeflow")
  l_ply(
    .data= head( nldasHours, 35),
    .fun= dumpWhiskerOutput,
    template= template,
    dataDir= "/project/joshuaelliott/nldas/data/NLDAS_FORA0125_H.002",
    file= "Makeflow")
#+END_SRC

** Aggregate hourly values into daily variables

#+BEGIN_SRC mustache :eval no :tangle tangle/dailyAggRuleTemplate.mustache :tangle no :export no
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmax.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,tmax -timmax -selname,TMP {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmax.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmin.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,tmin -timmin -selname,TMP {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmin.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.precip.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,precip -timsum -selname,APCP {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.precip.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.solar.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,solar -timavg -selname,DSWRF {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.solar.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.pres.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,pres -timavg -selname,PRES {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.pres.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.spfh.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,spfh -timavg -selname,SPFH {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.spfh.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.u.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,u -timavg -selname,UGRD {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.u.nc
{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.v.nc: {{> dailyMergeFile}}
cdo setzaxis,surface -setname,v -timavg -selname,VGRD {{> dailyMergeFile}} {{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.v.nc
#+END_SRC

#+BEGIN_SRC R
  dailyAggRuleTemplate <- paste(
    "",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmax.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,tmax -timmax -selname,TMP {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmax.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmin.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,tmin -timmin -selname,TMP {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.tmin.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.precip.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,precip -timsum -selname,APCP {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.precip.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.solar.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,solar -timavg -selname,DSWRF {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.solar.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.pres.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,pres -timavg -selname,PRES {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.pres.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.spfh.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,spfh -timavg -selname,SPFH {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.spfh.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.u.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,u -timavg -selname,UGRD {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.u.nc\n",
    "$projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.v.nc: {{> dailyMergeFile}}",
    "cdo setzaxis,surface -setname,v -timavg -selname,VGRD {{> dailyMergeFile}} $projectDir/{{dataDir}}/{{dailyYj}}/NLDAS_FORA0125_H.A{{dailyYmd}}.v.nc\n",
      sep= "\n")
  
  renderDailyAggData <- function( nldasDate, template, partials, ...) {
    data <- list(
      dailyYj= format( nldasDate, "%Y/%j"),
      dailyYmd= format( nldasDate, "%Y%m%d"),
      ...)
    whisker.render(
      template,
      data= data,
      partials= partials)
  }
#+END_SRC
  
#+BEGIN_SRC R :results output replace
  cat( renderDailyAggData(
    head( nldasDates, n=1),
    template= dailyAggRuleTemplate,
    partials= list(
      dailyMergeFile= dailyMergeFileTemplate),
    dataDir= "data/NLDAS_FORA0125_H.002"))
#+END_SRC

#+RESULTS:
#+begin_example
 
$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.tmax.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,tmax -timmax -selname,TMP $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.tmax.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.tmin.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,tmin -timmin -selname,TMP $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.tmin.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.precip.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,precip -timsum -selname,APCP $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.precip.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.solar.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,solar -timavg -selname,DSWRF $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.solar.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.pres.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,pres -timavg -selname,PRES $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.pres.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.spfh.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,spfh -timavg -selname,SPFH $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.spfh.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.u.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,u -timavg -selname,UGRD $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.u.nc

$projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.v.nc: $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc
cdo setzaxis,surface -setname,v -timavg -selname,VGRD $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.merge.nc $projectDir/data/NLDAS_FORA0125_H.002/1979/001/NLDAS_FORA0125_H.A19790101.v.nc
#+end_example

#+NAME: writeAggregationRulesTest
#+BEGIN_SRC R :export no
  cat(
    laply(
      .data= head( nldasDates, 2),
      .fun= renderDailyAggData,
      template= dailyAggRuleTemplate,
      partials= list(
        dailyMergeFile= dailyMergeFileTemplate),
      dataDir= "data/NLDAS_FORA0125_H.002"),
    file= "Makeflow.test",
    append= TRUE)
#+END_SRC

#+NAME: writeAggregationRules
#+BEGIN_SRC R :export no
  cat(
    laply(
      .data= nldasDates,
      .fun= renderDailyAggData,
      template= dailyAggRuleTemplate,
      partials= list(
        dailyMergeFile= dailyMergeFileTemplate),
      dataDir= "data/NLDAS_FORA0125_H.002"),
    file= "Makeflow",
    append= TRUE)
#+END_SRC

*** This works

#+BEGIN_SRC R
  remapRecipeData <- unname(
    rowSplit(
      data.frame(
        var= psimsVars,
        inputDir= "$projectDir/data/annual",
        outputDir= "$projectDir/data/full")))
  
  ## remapRecipeTemplate <- "
  ## {{# remapRecipeData}}
  ## {{> remapTarget}}: {{> allTimeTarget}}
  ##
  ## cdo remapnn,data/nldas_5min.grid {{> allTimeTarget}} {{> remapTarget}}
  ##
  ## {{/ remapRecipeData}}"
  
  remapRecipeTemplate <- c(
  "{{# remapRecipeData}}",
  "{{> remapTarget}}: {{> allTimeTarget}}",
  "",
  "\ncdo remapnn,$projectDir/data/nldas_5min.grid {{> allTimeTarget}} {{> remapTarget}}",
  "",
  "{{/ remapRecipeData}}")
  ##remapRecipeTemplate <- paste( remapRecipeTemplate, sep= "\n")
  remapRecipeTemplate <- paste( remapRecipeTemplate, collapse= "\n")
                              
    
  remapRecipes <-
    whisker.render(
      remapRecipeTemplate,
      partials= list(
        allTimeTarget= allTimeTargetTemplate,
        remapTarget= remapTargetTemplate))
#+END_SRC

#+BEGIN_SRC R :results output replace verbatim
  cat( remapRecipes)
#+END_SRC

#+RESULTS:
#+begin_example
$projectDir/data/full/tmax_nldas_1979-2013.nc4: $projectDir/data/full/tmax_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/tmax_nldas_1979-2013_0125.nc4 $projectDir/data/full/tmax_nldas_1979-2013.nc4

$projectDir/data/full/tmin_nldas_1979-2013.nc4: $projectDir/data/full/tmin_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/tmin_nldas_1979-2013_0125.nc4 $projectDir/data/full/tmin_nldas_1979-2013.nc4

$projectDir/data/full/precip_nldas_1979-2013.nc4: $projectDir/data/full/precip_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/precip_nldas_1979-2013_0125.nc4 $projectDir/data/full/precip_nldas_1979-2013.nc4

$projectDir/data/full/solar_nldas_1979-2013.nc4: $projectDir/data/full/solar_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/solar_nldas_1979-2013_0125.nc4 $projectDir/data/full/solar_nldas_1979-2013.nc4

$projectDir/data/full/pres_nldas_1979-2013.nc4: $projectDir/data/full/pres_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/pres_nldas_1979-2013_0125.nc4 $projectDir/data/full/pres_nldas_1979-2013.nc4

$projectDir/data/full/spfh_nldas_1979-2013.nc4: $projectDir/data/full/spfh_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/spfh_nldas_1979-2013_0125.nc4 $projectDir/data/full/spfh_nldas_1979-2013.nc4

$projectDir/data/full/u_nldas_1979-2013.nc4: $projectDir/data/full/u_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/u_nldas_1979-2013_0125.nc4 $projectDir/data/full/u_nldas_1979-2013.nc4

$projectDir/data/full/v_nldas_1979-2013.nc4: $projectDir/data/full/v_nldas_1979-2013_0125.nc4
cdo remapnn,$projectDir/data/nldas_5min.grid $projectDir/data/full/v_nldas_1979-2013_0125.nc4 $projectDir/data/full/v_nldas_1979-2013.nc4
#+end_example

#+NAME: writeRemapRules
#+BEGIN_SRC R :export no
  cat( "\n", remapRecipes, file= "Makeflow", append= TRUE)
#+END_SRC

#+NAME: writeRemapRulesTest
#+BEGIN_SRC R :export no
  cat( "\n", remapRecipes, file= "Makeflow.test", append= TRUE)
#+END_SRC


** TODO Bring the =writePsims.{sh,sbatch,r} code into this document for completeness

#+BEGIN_SRC sh :session :results output replace :exports code
  scripts/writePsims.sh
#+END_SRC

#+RESULTS:
#+begin_example
| Submitting ::   job name | output file | error file | sbatch file | job id |
| Submitting :: writePsims | ./log/writePsims.1.out | ./log/writePsims.1.err | scripts/writePsims.sbatch |Submitted batch job 6983263
| Submitting :: writePsims | ./log/writePsims.2.out | ./log/writePsims.2.err | scripts/writePsims.sbatch |Submitted batch job 6983264
| Submitting :: writePsims | ./log/writePsims.3.out | ./log/writePsims.3.err | scripts/writePsims.sbatch |Submitted batch job 6983265
| Submitting :: writePsims | ./log/writePsims.4.out | ./log/writePsims.4.err | scripts/writePsims.sbatch |Submitted batch job 6983266
| Submitting :: writePsims | ./log/writePsims.5.out | ./log/writePsims.5.err | scripts/writePsims.sbatch |Submitted batch job 6983267
| Submitting :: writePsims | ./log/writePsims.6.out | ./log/writePsims.6.err | scripts/writePsims.sbatch |Submitted batch job 6983268
| Submitting :: writePsims | ./log/writePsims.7.out | ./log/writePsims.7.err | scripts/writePsims.sbatch |Submitted batch job 6983269
| Submitting :: writePsims | ./log/writePsims.8.out | ./log/writePsims.8.err | scripts/writePsims.sbatch |Submitted batch job 6983270
| Submitting :: writePsims | ./log/writePsims.9.out | ./log/writePsims.9.err | scripts/writePsims.sbatch |Submitted batch job 6983271
| Submitting :: writePsims | ./log/writePsims.10.out | ./log/writePsims.10.err | scripts/writePsims.sbatch |Submitted batch job 6983272
| Submitting :: writePsims | ./log/writePsims.11.out | ./log/writePsims.11.err | scripts/writePsims.sbatch |Submitted batch job 6983273
| Submitting :: writePsims | ./log/writePsims.12.out | ./log/writePsims.12.err | scripts/writePsims.sbatch |Submitted batch job 6983274
| Submitting :: writePsims | ./log/writePsims.13.out | ./log/writePsims.13.err | scripts/writePsims.sbatch |Submitted batch job 6983275
| Submitting :: writePsims | ./log/writePsims.14.out | ./log/writePsims.14.err | scripts/writePsims.sbatch |Submitted batch job 6983276
| Submitting :: writePsims | ./log/writePsims.15.out | ./log/writePsims.15.err | scripts/writePsims.sbatch |Submitted batch job 6983277
| Submitting :: writePsims | ./log/writePsims.16.out | ./log/writePsims.16.err | scripts/writePsims.sbatch |Submitted batch job 6983278
| Submitting :: writePsims | ./log/writePsims.17.out | ./log/writePsims.17.err | scripts/writePsims.sbatch |Submitted batch job 6983279
| Submitting :: writePsims | ./log/writePsims.18.out | ./log/writePsims.18.err | scripts/writePsims.sbatch |Submitted batch job 6983280
| Submitting :: writePsims | ./log/writePsims.19.out | ./log/writePsims.19.err | scripts/writePsims.sbatch |Submitted batch job 6983281
| Submitting :: writePsims | ./log/writePsims.20.out | ./log/writePsims.20.err | scripts/writePsims.sbatch |Submitted batch job 6983282
| Submitting :: writePsims | ./log/writePsims.21.out | ./log/writePsims.21.err | scripts/writePsims.sbatch |Submitted batch job 6983283
| Submitting :: writePsims | ./log/writePsims.22.out | ./log/writePsims.22.err | scripts/writePsims.sbatch |Submitted batch job 6983284
| Submitting :: writePsims | ./log/writePsims.23.out | ./log/writePsims.23.err | scripts/writePsims.sbatch |Submitted batch job 6983285
| Submitting :: writePsims | ./log/writePsims.24.out | ./log/writePsims.24.err | scripts/writePsims.sbatch |Submitted batch job 6983286
| Submitting :: writePsims | ./log/writePsims.25.out | ./log/writePsims.25.err | scripts/writePsims.sbatch |Submitted batch job 6983287
| Submitting :: writePsims | ./log/writePsims.26.out | ./log/writePsims.26.err | scripts/writePsims.sbatch |Submitted batch job 6983288
| Submitting :: writePsims | ./log/writePsims.27.out | ./log/writePsims.27.err | scripts/writePsims.sbatch |Submitted batch job 6983289
| Submitting :: writePsims | ./log/writePsims.28.out | ./log/writePsims.28.err | scripts/writePsims.sbatch |Submitted batch job 6983290
| Submitting :: writePsims | ./log/writePsims.29.out | ./log/writePsims.29.err | scripts/writePsims.sbatch |Submitted batch job 6983291
| Submitting :: writePsims | ./log/writePsims.30.out | ./log/writePsims.30.err | scripts/writePsims.sbatch |Submitted batch job 6983292
| Submitting :: writePsims | ./log/writePsims.31.out | ./log/writePsims.31.err | scripts/writePsims.sbatch |Submitted batch job 6983293
| Submitting :: writePsims | ./log/writePsims.32.out | ./log/writePsims.32.err | scripts/writePsims.sbatch |Submitted batch job 6983294
| Submitting :: writePsims | ./log/writePsims.33.out | ./log/writePsims.33.err | scripts/writePsims.sbatch |Submitted batch job 6983295
| Submitting :: writePsims | ./log/writePsims.34.out | ./log/writePsims.34.err | scripts/writePsims.sbatch |Submitted batch job 6983296
| Submitting :: writePsims | ./log/writePsims.35.out | ./log/writePsims.35.err | scripts/writePsims.sbatch |Submitted batch job 6983297
| Submitting :: writePsims | ./log/writePsims.36.out | ./log/writePsims.36.err | scripts/writePsims.sbatch |Submitted batch job 6983298
| Submitting :: writePsims | ./log/writePsims.37.out | ./log/writePsims.37.err | scripts/writePsims.sbatch |Submitted batch job 6983299
| Submitting :: writePsims | ./log/writePsims.38.out | ./log/writePsims.38.err | scripts/writePsims.sbatch |Submitted batch job 6983300
| Submitting :: writePsims | ./log/writePsims.39.out | ./log/writePsims.39.err | scripts/writePsims.sbatch |Submitted batch job 6983301
| Submitting :: writePsims | ./log/writePsims.40.out | ./log/writePsims.40.err | scripts/writePsims.sbatch |Submitted batch job 6983302
| Submitting :: writePsims | ./log/writePsims.41.out | ./log/writePsims.41.err | scripts/writePsims.sbatch |Submitted batch job 6983303
| Submitting :: writePsims | ./log/writePsims.42.out | ./log/writePsims.42.err | scripts/writePsims.sbatch |Submitted batch job 6983304
| Submitting :: writePsims | ./log/writePsims.43.out | ./log/writePsims.43.err | scripts/writePsims.sbatch |Submitted batch job 6983305
| Submitting :: writePsims | ./log/writePsims.44.out | ./log/writePsims.44.err | scripts/writePsims.sbatch |Submitted batch job 6983306
| Submitting :: writePsims | ./log/writePsims.45.out | ./log/writePsims.45.err | scripts/writePsims.sbatch |Submitted batch job 6983307
| Submitting :: writePsims | ./log/writePsims.46.out | ./log/writePsims.46.err | scripts/writePsims.sbatch |Submitted batch job 6983308
| Submitting :: writePsims | ./log/writePsims.47.out | ./log/writePsims.47.err | scripts/writePsims.sbatch |Submitted batch job 6983309
| Submitting :: writePsims | ./log/writePsims.48.out | ./log/writePsims.48.err | scripts/writePsims.sbatch |Submitted batch job 6983310
| Submitting :: writePsims | ./log/writePsims.49.out | ./log/writePsims.49.err | scripts/writePsims.sbatch |Submitted batch job 6983311
| Submitting :: writePsims | ./log/writePsims.50.out | ./log/writePsims.50.err | scripts/writePsims.sbatch |Submitted batch job 6983312
| Submitting :: writePsims | ./log/writePsims.51.out | ./log/writePsims.51.err | scripts/writePsims.sbatch |Submitted batch job 6983313
| Submitting :: writePsims | ./log/writePsims.52.out | ./log/writePsims.52.err | scripts/writePsims.sbatch |Submitted batch job 6983314
| Submitting :: writePsims | ./log/writePsims.53.out | ./log/writePsims.53.err | scripts/writePsims.sbatch |Submitted batch job 6983315
| Submitting :: writePsims | ./log/writePsims.54.out | ./log/writePsims.54.err | scripts/writePsims.sbatch |Submitted batch job 6983316
| Submitting :: writePsims | ./log/writePsims.55.out | ./log/writePsims.55.err | scripts/writePsims.sbatch |Submitted batch job 6983317
| Submitting :: writePsims | ./log/writePsims.56.out | ./log/writePsims.56.err | scripts/writePsims.sbatch |Submitted batch job 6983318
| Submitting :: writePsims | ./log/writePsims.57.out | ./log/writePsims.57.err | scripts/writePsims.sbatch |Submitted batch job 6983319
| Submitting :: writePsims | ./log/writePsims.58.out | ./log/writePsims.58.err | scripts/writePsims.sbatch |Submitted batch job 6983320
| Submitting :: writePsims | ./log/writePsims.59.out | ./log/writePsims.59.err | scripts/writePsims.sbatch |Submitted batch job 6983321
| Submitting :: writePsims | ./log/writePsims.60.out | ./log/writePsims.60.err | scripts/writePsims.sbatch |Submitted batch job 6983322
| Submitting :: writePsims | ./log/writePsims.61.out | ./log/writePsims.61.err | scripts/writePsims.sbatch |Submitted batch job 6983323
| Submitting :: writePsims | ./log/writePsims.62.out | ./log/writePsims.62.err | scripts/writePsims.sbatch |Submitted batch job 6983324
| Submitting :: writePsims | ./log/writePsims.63.out | ./log/writePsims.63.err | scripts/writePsims.sbatch |Submitted batch job 6983325
| Submitting :: writePsims | ./log/writePsims.64.out | ./log/writePsims.64.err | scripts/writePsims.sbatch |Submitted batch job 6983326
| Submitting :: writePsims | ./log/writePsims.65.out | ./log/writePsims.65.err | scripts/writePsims.sbatch |Submitted batch job 6983327
| Submitting :: writePsims | ./log/writePsims.66.out | ./log/writePsims.66.err | scripts/writePsims.sbatch |Submitted batch job 6983328
| Submitting :: writePsims | ./log/writePsims.67.out | ./log/writePsims.67.err | scripts/writePsims.sbatch |Submitted batch job 6983329
| Submitting :: writePsims | ./log/writePsims.68.out | ./log/writePsims.68.err | scripts/writePsims.sbatch |Submitted batch job 6983330
| Submitting :: writePsims | ./log/writePsims.69.out | ./log/writePsims.69.err | scripts/writePsims.sbatch |Submitted batch job 6983331
| Submitting :: writePsims | ./log/writePsims.70.out | ./log/writePsims.70.err | scripts/writePsims.sbatch |Submitted batch job 6983332
| Submitting :: writePsims | ./log/writePsims.71.out | ./log/writePsims.71.err | scripts/writePsims.sbatch |Submitted batch job 6983333
| Submitting :: writePsims | ./log/writePsims.72.out | ./log/writePsims.72.err | scripts/writePsims.sbatch |Submitted batch job 6983334
| Submitting :: writePsims | ./log/writePsims.73.out | ./log/writePsims.73.err | scripts/writePsims.sbatch |Submitted batch job 6983335
| Submitting :: writePsims | ./log/writePsims.74.out | ./log/writePsims.74.err | scripts/writePsims.sbatch |Submitted batch job 6983336
| Submitting :: writePsims | ./log/writePsims.75.out | ./log/writePsims.75.err | scripts/writePsims.sbatch |Submitted batch job 6983337
| Submitting :: writePsims | ./log/writePsims.76.out | ./log/writePsims.76.err | scripts/writePsims.sbatch |Submitted batch job 6983338
| Submitting :: writePsims | ./log/writePsims.77.out | ./log/writePsims.77.err | scripts/writePsims.sbatch |Submitted batch job 6983339
| Submitting :: writePsims | ./log/writePsims.78.out | ./log/writePsims.78.err | scripts/writePsims.sbatch |Submitted batch job 6983340
| Submitting :: writePsims | ./log/writePsims.79.out | ./log/writePsims.79.err | scripts/writePsims.sbatch |Submitted batch job 6983341
| Submitting :: writePsims | ./log/writePsims.80.out | ./log/writePsims.80.err | scripts/writePsims.sbatch |Submitted batch job 6983342
| Submitting :: writePsims | ./log/writePsims.81.out | ./log/writePsims.81.err | scripts/writePsims.sbatch |Submitted batch job 6983343
| Submitting :: writePsims | ./log/writePsims.82.out | ./log/writePsims.82.err | scripts/writePsims.sbatch |Submitted batch job 6983344
| Submitting :: writePsims | ./log/writePsims.83.out | ./log/writePsims.83.err | scripts/writePsims.sbatch |Submitted batch job 6983345
| Submitting :: writePsims | ./log/writePsims.84.out | ./log/writePsims.84.err | scripts/writePsims.sbatch |Submitted batch job 6983346
| Submitting :: writePsims | ./log/writePsims.85.out | ./log/writePsims.85.err | scripts/writePsims.sbatch |Submitted batch job 6983347
| Submitting :: writePsims | ./log/writePsims.86.out | ./log/writePsims.86.err | scripts/writePsims.sbatch |Submitted batch job 6983348
| Submitting :: writePsims | ./log/writePsims.87.out | ./log/writePsims.87.err | scripts/writePsims.sbatch |Submitted batch job 6983349
| Submitting :: writePsims | ./log/writePsims.88.out | ./log/writePsims.88.err | scripts/writePsims.sbatch |Submitted batch job 6983350
| Submitting :: writePsims | ./log/writePsims.89.out | ./log/writePsims.89.err | scripts/writePsims.sbatch |Submitted batch job 6983351
| Submitting :: writePsims | ./log/writePsims.90.out | ./log/writePsims.90.err | scripts/writePsims.sbatch |Submitted batch job 6983352
| Submitting :: writePsims | ./log/writePsims.91.out | ./log/writePsims.91.err | scripts/writePsims.sbatch |Submitted batch job 6983353
| Submitting :: writePsims | ./log/writePsims.92.out | ./log/writePsims.92.err | scripts/writePsims.sbatch |Submitted batch job 6983354
| Submitting :: writePsims | ./log/writePsims.93.out | ./log/writePsims.93.err | scripts/writePsims.sbatch |Submitted batch job 6983355
| Submitting :: writePsims | ./log/writePsims.94.out | ./log/writePsims.94.err | scripts/writePsims.sbatch |Submitted batch job 6983356
| Submitting :: writePsims | ./log/writePsims.95.out | ./log/writePsims.95.err | scripts/writePsims.sbatch |Submitted batch job 6983357
| Submitting :: writePsims | ./log/writePsims.96.out | ./log/writePsims.96.err | scripts/writePsims.sbatch |Submitted batch job 6983358
| Submitting :: writePsims | ./log/writePsims.97.out | ./log/writePsims.97.err | scripts/writePsims.sbatch |Submitted batch job 6983359
| Submitting :: writePsims | ./log/writePsims.98.out | ./log/writePsims.98.err | scripts/writePsims.sbatch |Submitted batch job 6983360
| Submitting :: writePsims | ./log/writePsims.99.out | ./log/writePsims.99.err | scripts/writePsims.sbatch |Submitted batch job 6983361
| Submitting :: writePsims | ./log/writePsims.100.out | ./log/writePsims.100.err | scripts/writePsims.sbatch |Submitted batch job 6983362
| Submitting :: writePsims | ./log/writePsims.101.out | ./log/writePsims.101.err | scripts/writePsims.sbatch |Submitted batch job 6983363
| Submitting :: writePsims | ./log/writePsims.102.out | ./log/writePsims.102.err | scripts/writePsims.sbatch |Submitted batch job 6983364
| Submitting :: writePsims | ./log/writePsims.103.out | ./log/writePsims.103.err | scripts/writePsims.sbatch |Submitted batch job 6983365
| Submitting :: writePsims | ./log/writePsims.104.out | ./log/writePsims.104.err | scripts/writePsims.sbatch |Submitted batch job 6983366
| Submitting :: writePsims | ./log/writePsims.105.out | ./log/writePsims.105.err | scripts/writePsims.sbatch |Submitted batch job 6983367
| Submitting :: writePsims | ./log/writePsims.106.out | ./log/writePsims.106.err | scripts/writePsims.sbatch |Submitted batch job 6983368
| Submitting :: writePsims | ./log/writePsims.107.out | ./log/writePsims.107.err | scripts/writePsims.sbatch |Submitted batch job 6983369
| Submitting :: writePsims | ./log/writePsims.108.out | ./log/writePsims.108.err | scripts/writePsims.sbatch |Submitted batch job 6983370
| Submitting :: writePsims | ./log/writePsims.109.out | ./log/writePsims.109.err | scripts/writePsims.sbatch |Submitted batch job 6983371
| Submitting :: writePsims | ./log/writePsims.110.out | ./log/writePsims.110.err | scripts/writePsims.sbatch |Submitted batch job 6983372
| Submitting :: writePsims | ./log/writePsims.111.out | ./log/writePsims.111.err | scripts/writePsims.sbatch |Submitted batch job 6983373
| Submitting :: writePsims | ./log/writePsims.112.out | ./log/writePsims.112.err | scripts/writePsims.sbatch |Submitted batch job 6983374
| Submitting :: writePsims | ./log/writePsims.113.out | ./log/writePsims.113.err | scripts/writePsims.sbatch |Submitted batch job 6983375
| Submitting :: writePsims | ./log/writePsims.114.out | ./log/writePsims.114.err | scripts/writePsims.sbatch |Submitted batch job 6983376
| Submitting :: writePsims | ./log/writePsims.115.out | ./log/writePsims.115.err | scripts/writePsims.sbatch |Submitted batch job 6983377
| Submitting :: writePsims | ./log/writePsims.116.out | ./log/writePsims.116.err | scripts/writePsims.sbatch |Submitted batch job 6983378
#+end_example


